Revit 2026 API

# PhaseStatusPresentation Enumeration

---

An enumerated type listing the options for element display in a phase filter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum PhaseStatusPresentation
```
```vb
Public Enumeration PhaseStatusPresentation
```
```cpp
public enum class PhaseStatusPresentation
```
```fsharp
type PhaseStatusPresentation
```

| Member name | Value | Description |
| --- | --- | --- |
| DontShow | 0 | Don't show elements from the given phase status. |
| ShowByCategory | 1 | Show elements from the given phase status by category. |
| ShowOverriden | 2 | Show elements from the given phase status by graphics overrides. |

#### Reference

Autodesk.Revit.DB Namespace